## Plan Result (prod_appgw)




<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * azurerm_application_gateway.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_gateway.this will be updated in-place
  ~ resource "azurerm_application_gateway" "this" {
        id                                = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod"
        name                              = "crime-portal-appgw-prod"
        tags                              = {
            "application"  = "crime-portal"
            "builtFrom"    = "hmcts/crime-portal-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "High"
            "environment"  = "production"
            "startupMode"  = "always"
        }
        # (7 unchanged attributes hidden)

      - backend_http_settings {
          - cookie_based_affinity               = "Enabled" -> null
          - host_name                           = "crimeportal.apps.hmcts.net" -> null
          - id                                  = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/backendHttpSettingsCollection/crime-portal-behttp01-prod" -> null
          - name                                = "crime-portal-behttp01-prod" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/probes/http" -> null
          - probe_name                          = "http" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 60 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Enabled" -> null
          - host_name                           = "lncs-crimeportal-notify.lncs.hmcs" -> null
          - id                                  = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/backendHttpSettingsCollection/crime-portal-behttp02-prod" -> null
          - name                                = "crime-portal-behttp02-prod" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/probes/http" -> null
          - probe_name                          = "http" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 60 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Enabled"
          + host_name                           = "crimeportal.apps.hmcts.net"
          + id                                  = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/backendHttpSettingsCollection/crime-portal-behttp01-prod"
          + name                                = "crime-portal-behttp01-prod"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/probes/http"
          + probe_name                          = "http"
          + protocol                            = "Http"
          + request_timeout                     = 60
          + trusted_root_certificate_names      = []
        }

      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/frontendIPConfigurations/crime-portal-private-prod" -> null
          - frontend_ip_configuration_name = "crime-portal-private-prod" -> null
          - frontend_port_id               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/frontendPorts/http" -> null
          - frontend_port_name             = "http" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/httpListeners/crime-portal-http-listener" -> null
          - name                           = "crime-portal-http-listener" -> null
          - protocol                       = "Http" -> null
          - require_sni                    = false -> null
        }
      - http_listener {
          - frontend_ip_configuration_id   = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/frontendIPConfigurations/crime-portal-private-prod" -> null
          - frontend_ip_configuration_name = "crime-portal-private-prod" -> null
          - frontend_port_id               = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/frontendPorts/https" -> null
          - frontend_port_name             = "https" -> null
          - host_names                     = [] -> null
          - id                             = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/httpListeners/crime-portal-https-listener" -> null
          - name                           = "crime-portal-https-listener" -> null
          - protocol                       = "Https" -> null
          - require_sni                    = false -> null
          - ssl_certificate_id             = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/sslCertificates/lncs" -> null
          - ssl_certificate_name           = "lncs" -> null
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "crime-portal-private-prod"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "Http"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "crime-portal-http-listener"
          + protocol                       = "Http"
          + ssl_certificate_id             = (known after apply)
          + ssl_profile_id                 = (known after apply)
        }
      + http_listener {
          + frontend_ip_configuration_id   = (known after apply)
          + frontend_ip_configuration_name = "crime-portal-private-prod"
          + frontend_port_id               = (known after apply)
          + frontend_port_name             = "https"
          + host_names                     = []
          + id                             = (known after apply)
          + name                           = "crime-portal-https-listener"
          + protocol                       = "Https"
          + ssl_certificate_id             = (known after apply)
          + ssl_certificate_name           = "lets_encrypt"
          + ssl_profile_id                 = (known after apply)
        }

      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/backendAddressPools/crime-portal-bap01-prod" -> null
          - backend_address_pool_name  = "crime-portal-bap01-prod" -> null
          - backend_http_settings_id   = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/backendHttpSettingsCollection/crime-portal-behttp01-prod" -> null
          - backend_http_settings_name = "crime-portal-behttp01-prod" -> null
          - http_listener_id           = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/httpListeners/crime-portal-http-listener" -> null
          - http_listener_name         = "crime-portal-http-listener" -> null
          - id                         = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/requestRoutingRules/crime-portal-http-rule" -> null
          - name                       = "crime-portal-http-rule" -> null
          - priority                   = 20 -> null
          - rewrite_rule_set_id        = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/rewriteRuleSets/crime-portal-rewrites" -> null
          - rewrite_rule_set_name      = "crime-portal-rewrites" -> null
          - rule_type                  = "Basic" -> null
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/backendAddressPools/crime-portal-bap01-prod" -> null
          - backend_address_pool_name  = "crime-portal-bap01-prod" -> null
          - backend_http_settings_id   = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/backendHttpSettingsCollection/crime-portal-behttp02-prod" -> null
          - backend_http_settings_name = "crime-portal-behttp02-prod" -> null
          - http_listener_id           = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/httpListeners/crime-portal-https-listener" -> null
          - http_listener_name         = "crime-portal-https-listener" -> null
          - id                         = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/requestRoutingRules/crime-portal-https-rule" -> null
          - name                       = "crime-portal-https-rule" -> null
          - priority                   = 21 -> null
          - rewrite_rule_set_id        = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/rewriteRuleSets/crime-portal-rewrites" -> null
          - rewrite_rule_set_name      = "crime-portal-rewrites" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/backendAddressPools/crime-portal-bap01-prod"
          + backend_address_pool_name  = "crime-portal-bap01-prod"
          + backend_http_settings_id   = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/backendHttpSettingsCollection/crime-portal-behttp01-prod"
          + backend_http_settings_name = "crime-portal-behttp01-prod"
          + http_listener_id           = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/httpListeners/crime-portal-http-listener"
          + http_listener_name         = "crime-portal-http-listener"
          + id                         = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/requestRoutingRules/crime-portal-http-rule"
          + name                       = "crime-portal-http-rule"
          + priority                   = 20
          + rewrite_rule_set_id        = "/subscriptions/17390ec1-5a5e-4a20-afb3-38d8d726ae45/resourceGroups/crime-portal-rg-prod/providers/Microsoft.Network/applicationGateways/crime-portal-appgw-prod/rewriteRuleSets/crime-portal-rewrites"
          + rewrite_rule_set_name      = "crime-portal-rewrites"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "crime-portal-bap01-prod"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "crime-portal-behttp01-prod"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "crime-portal-https-listener"
          + id                         = (known after apply)
          + name                       = "crime-portal-https-rule"
          + priority                   = 21
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "crime-portal-rewrites"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

        # (14 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":57,"Program":"tfcmt","SHA1":"","Target":"prod_appgw","Vars":{}} -->